Revit 2026 API

# IFCFamilyInstanceExtrusionExportResults Properties

---

The IFCFamilyInstanceExtrusionExportResults type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExtraOffset | The extra offset determined from the geometry of the family instance. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaterialId | The best material id determined for the family instance. |

#### Reference

IFCFamilyInstanceExtrusionExportResults Class

Autodesk.Revit.DB.IFC Namespace